# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### Load Required Libraries

In [1]:
import mysql.connector

### Connect to DB using Mysql-connector-python package

In [2]:
remoteVar= mysql.connector.connect(
    host= "localhost",
    username= "root",
    password= "Asdfgh@12345"
)
cursorVar= remoteVar.cursor();

### You are required to create a database named 'e_commerce'

In [3]:
cursorVar.execute("create database if not exists lab_data_handeling")

In [4]:
cursorVar.close()
remoteVar.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [5]:
remoteVar= mysql.connector.connect(
    host="localhost",
    username="root",
    password= "Asdfgh@12345",
database= "lab_data_handeling"
)
cursorVar= remoteVar.cursor();

In [6]:
createTab1 = """
CREATE TABLE IF NOT EXISTS `supplier` (
    SUPP_ID INT PRIMARY KEY, 
    SUPP_NAME VARCHAR(50), 
    SUPP_CITY VARCHAR(50), 
    SUPP_PHONE VARCHAR(10)
);"""

createTab2 = """CREATE TABLE IF NOT EXISTS `customer` (
    CUS_ID INT NOT NULL, 
    CUS_NAME VARCHAR(20) NULL DEFAULT NULL, 
    CUS_PHONE VARCHAR(10),
    CUS_CITY VARCHAR(30), 
    CUS_GENDER CHAR,
    PRIMARY KEY (CUS_ID)
);"""

createTab3 = """CREATE TABLE IF NOT EXISTS `category` (
    CAT_ID INT NOT NULL, 
    CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
    PRIMARY KEY (CAT_ID)
);"""

createTab4 = """CREATE TABLE IF NOT EXISTS `product` (
    PRO_ID INT NOT NULL, 
    PRO_NAME VARCHAR(20) NULL DEFAULT NULL, 
    PRO_DESC VARCHAR(60) NULL DEFAULT NULL, 
    CAT_ID INT NOT NULL,
    PRIMARY KEY (PRO_ID),
    FOREIGN KEY (CAT_ID) REFERENCES `category` (CAT_ID)
);"""

createTab5 = """CREATE TABLE IF NOT EXISTS `product_details` (
    PROD_ID INT NOT NULL, 
    PRO_ID INT NOT NULL, 
    SUPP_ID INT NOT NULL, 
    PROD_PRICE INT NOT NULL,
    PRIMARY KEY (PROD_ID),
    FOREIGN KEY (PRO_ID) REFERENCES `product` (PRO_ID),
    FOREIGN KEY (SUPP_ID) REFERENCES `supplier` (SUPP_ID)
);"""

createTab6 = """CREATE TABLE IF NOT EXISTS `orders` (
    ORD_ID INT NOT NULL, 
    ORD_AMOUNT INT NOT NULL, 
    ORD_DATE DATE, 
    CUS_ID INT NOT NULL, 
    PROD_ID INT NOT NULL,
    PRIMARY KEY (ORD_ID),
    FOREIGN KEY (CUS_ID) REFERENCES `customer` (CUS_ID),
    FOREIGN KEY (PROD_ID) REFERENCES `product_details` (PROD_ID)
);"""

createTab7 = """CREATE TABLE IF NOT EXISTS `rating` (
    RAT_ID INT NOT NULL, 
    CUS_ID INT NOT NULL, 
    SUPP_ID INT NOT NULL, 
    RAT_RATSTARS INT NOT NULL,
    PRIMARY KEY (RAT_ID),
    FOREIGN KEY (SUPP_ID) REFERENCES `supplier` (SUPP_ID),
    FOREIGN KEY (CUS_ID) REFERENCES `customer` (CUS_ID)
);"""

cursorVar.execute(createTab1)
cursorVar.execute(createTab2)
cursorVar.execute(createTab3)
cursorVar.execute(createTab4)
cursorVar.execute(createTab5)
cursorVar.execute(createTab6)
cursorVar.execute(createTab7)
remoteVar.commit()

In [7]:
cursorVar.close()
remoteVar.close()

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- |
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 |
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [8]:
remoteVar= mysql.connector.connect(
    host="localhost",
    username="root",
    password= "Asdfgh@12345",
database= "lab_data_handeling"
)
cursorVar= remoteVar.cursor();

In [9]:
# insert into "supplier" table

insertDetails = "insert Into supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"
data = [(1,"Rajesh Retails","Delhi",'1234567890'),
       (2,"Appario Ltd.","Mumbai",'2589631470'),
       (3,"Knome products","Banglore",'9785462315'),
       (4,"Bansal Retails","Kochi",'8975463285'),
       (5,"Mittal Ltd.","Lucknow",'7898456532')]

   
cursorVar.executemany(insertDetails, data)
remoteVar.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [10]:
# insert into "customer" table

insertDetails="insert into customer (CUS_ID, CUS_NAME,CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES(%s,%s,%s,%s,%s)";
data=[(1,"AAKASH",'9999999999',"DELHI",'M'),
       (2,"AMAN",'9785463215',"NOIDA",'M'),
       (3,"NEHA",'9999999999',"MUMBAI",'F'),
       (4,"MEGHA",'9994562399',"KOLKATA",'F'),
       (5,"PULKIT",'7895999999',"LUCKNOW",'M')]

cursorVar.executemany(insertDetails,data);
remoteVar.commit();

#### Table:  category
| CAT_ID | CAT_NAME |
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES |
| 4 | ELECTRONICS |
| 5 | CLOTHES |

In [11]:
# insert into "categoty" table
insertDetails="insert into category (CAT_ID, CAT_NAME) VALUES(%s,%s)"
data=[(1,"BOOKS"),
       (2,"GAMES"),
       (3,"GROCERIES"),
       (4,"ELECTRONICS"),
       (5,"CLOTHES")]
cursorVar.executemany(insertDetails,data);
remoteVar.commit();

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- |
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 |
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [12]:
# insert into "product" table
insertDetails="insert into product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s,%s,%s,%s)"
data=[(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
       (2,"TSHIRT","DFDFJDFJDKFD",5),
       (3,"ROG LAPTOP","DFNTTNTNTERND",4),
       (4,"OATS","REURENTBTOTH",3),
       (5,"HARRY POTTER","NBEMCTHTJTH",1)]
cursorVar.executemany(insertDetails,data)
remoteVar.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- |
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 |
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [13]:
# insert into "product_details" table
insertDetails="insert into product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)";
data=[(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)];
cursorVar.executemany(insertDetails, data)
remoteVar.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [14]:
# insert into "orders" table
insertDetails= "INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
data = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]


cursorVar.executemany(insertDetails, data)
remoteVar.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- |
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 |
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [15]:
# insert into "rating" table
insertDetails= "insert into rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"

data=[(1,2,2,4),
      (2,3,4,3),
      (3,5,1,5),
      (4,1,3,2),
      (5,4,5,4)]

cursorVar.executemany(insertDetails, data)
remoteVar.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [16]:
import pandas as pd;

In [17]:
groupbyG= """select customer.CUS_GENDER, count(customer.CUS_GENDER) as count from customer inner join orders 
on customer.CUS_ID= orders.CUS_ID where orders.ORD_AMOUNT>=3000 group by customer.CUS_GENDER;"""

cursorVar.execute(groupbyG);
fetchedVals= cursorVar.fetchall()

outputofDataframe= pd.DataFrame(fetchedVals, columns=['CUS_GENDER', 'COUNT'])

outputofDataframe

  CUS_GENDER  COUNT
0          M      1
1          F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [18]:
ordId= """select orders.*, product.PRO_NAME, product_details.PROD_PRICE from orders inner join product_details on product_details.PROD_ID=orders.PROD_ID inner join product on product.PRO_ID=orders.PROD_ID where orders.CUS_ID=2""";
cursorVar.execute(ordId);

outputId= cursorVar.fetchall();
dataframeOutputPD= pd.DataFrame(outputId, columns=["OrderId", "Order Amount", "Order Date", "Customer ID", "Product ID", "Product Name", "Product Price"])
dataframeOutputPD

,OrderId,Order Amount,Order Date,Customer ID,Product ID,Product Name,Product Price
0,50,2000,2021-10-06,2,1,GTA V,1500

### Q5) Display the Supplier details who can supply more than one product.

In [19]:
suppDet="""SELECT 
    supplier.SUPP_ID,
    supplier.SUPP_NAME,
    supplier.SUPP_CITY,
    supplier.SUPP_PHONE
    FROM supplier JOIN product_details ON supplier.SUPP_ID = product_details.SUPP_ID 
    GROUP BY supplier.SUPP_ID HAVING count(supplier.SUPP_ID)>1"""

cursorVar.execute(suppDet);
output=cursorVar.fetchall();
pdDFOutput=pd.DataFrame(output, columns=("SupplierID","Supplier Name", "Supplier City", "Supplier Phone"));
pdDFOutput

   SupplierID   Supplier Name Supplier City Supplier Phone
0           1  Rajesh Retails         Delhi     1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [20]:
minAmt="""select category.* FROM `orders` 
INNER JOIN product_details ON `orders`.prod_id = product_details.prod_id
INNER JOIN product ON product.pro_id = product_details.pro_id
INNER JOIN category ON category.cat_id = product.cat_id
where `orders`.ORD_AMOUNT=(select min(ORD_AMOUNT) from `orders`)"""
cursorVar.execute(minAmt);
fetchedData= cursorVar.fetchall();
pdMinAmt= pd.DataFrame(fetchedData, columns=["Cat ID", "Category Name"])
pdMinAmt

   Cat ID Category Name
0       3     GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [21]:
prdnm="""select product.PRO_ID,product.PRO_NAME 
from `orders` inner join product_details on product_details.PROD_ID=`orders`.PROD_ID 
inner join product on product.PRO_ID=product_details.PRO_ID where `orders`.ORD_DATE>"2021-10-05"; """
cursorVar.execute(prdnm);
fetchedData= cursorVar.fetchall();
pdMinAmt= pd.DataFrame(fetchedData, columns=["PROID", "PRODUCT NAME"])
pdMinAmt

   PROID PRODUCT NAME
0      4         OATS
1      1        GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [22]:
suppsort="""SELECT supplier.SUPP_ID, supplier.SUPP_NAME, rating.RAT_RATSTARS, customer.CUS_NAME
FROM rating
INNER JOIN supplier ON supplier.SUPP_ID = rating.SUPP_ID
INNER JOIN customer ON customer.CUS_ID = rating.CUS_ID
ORDER BY rating.RAT_RATSTARS DESC LIMIT 3"""

cursorVar.execute(suppsort);
result= cursorVar.fetchall();
pdOpt= pd.DataFrame(result, columns=["SupplierID", "Supplier Name", "Rating", "Customer Name"])
pdOpt

   SupplierID   Supplier Name  Rating Customer Name
0           1  Rajesh Retails       5        PULKIT
1           2    Appario Ltd.       4          AMAN
2           5     Mittal Ltd.       4         MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [23]:
nameGendA = """select customer.CUS_NAME, customer.CUS_GENDER 
from customer 
where customer.CUS_NAME like "%a" or customer.CUS_NAME like "a%"; """

cursorVar.execute(nameGendA);
resultz=cursorVar.fetchall();
PDopt= pd.DataFrame(resultz, columns=["CustomerName", "Gender"]);
PDopt

  CustomerName Gender
0       AAKASH      M
1         AMAN      M
2         NEHA      F
3        MEGHA      F

### Q10) Display the total order amount of the male customers.

In [24]:
amt= """select sum(orders.ORD_AMOUNT) as Amount 
from orders
inner join customer on orders.CUS_ID=customer.CUS_ID 
where customer.CUS_GENDER="M";"""

cursorVar.execute(amt);
resultFetched= cursorVar.fetchall();
pdConv= pd.DataFrame(resultFetched, columns=["Total Amount"]);
pdConv

  Total Amount
0        34500

### Q11) Display all the Customers left outer join with  the orders

In [25]:
leftJoinallCus="""select *
from customer 
left outer join `orders` on customer.CUS_ID= `orders`.CUS_ID"""

cursorVar.execute(leftJoinallCus);
outJoinRes=cursorVar.fetchall();
pdOpt= pd.DataFrame(outJoinRes, columns=["Customer ID","Customer Name", "CUstomer Phone", "Customer City", "Customer Gender", "ordID","ordAmt","ordDate","CusId","ProdID"]);
pdOpt

,Customer ID,Customer Name,CUstomer Phone,Customer City,Customer Gender,ordID,ordAmt,ordDate,CusId,ProdID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999999,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2

In [26]:
cursorVar.close()
remoteVar.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)